In [ ]:
# instalando a biblioteca pandas 
#!pip install pandas

In [1]:
# importando a biblioteca pandas
import pandas as pd

In [2]:
# Criando um dicionario
Dicionario = {
    'A':[1,2,3],
    'B':[-3,-2,-1],
    'C':[0,10,20]
}
Label = ['1ª Linha','2ª Linha','3ª Linha']
Dataframe_01= pd.DataFrame(Dicionario,index=Label)
print(Dataframe_01)

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [3]:
# Exibindo as colunas A e B
Dataframe_01[['A','B']]

          A  B
1ª Linha  1 -3
2ª Linha  2 -2
3ª Linha  3 -1

In [4]:
# Criando uma coluna nova no Dataframe
Dataframe_01['Nova coluna'] = Dataframe_01['A'] *Dataframe_01['B']

In [5]:
Dataframe_01 # Exibe o dataframe

          A  B   C  Nova coluna
1ª Linha  1 -3   0           -3
2ª Linha  2 -2  10           -4
3ª Linha  3 -1  20           -3

In [6]:
# Exibindo valores na saida da celula do notebook
a =6
print(a)
Dataframe_01

6

          A  B   C  Nova coluna
1ª Linha  1 -3   0           -3
2ª Linha  2 -2  10           -4
3ª Linha  3 -1  20           -3

In [7]:
# Excluindo uma coluna do Dataframe
# Drop exclui uma linha ou coluna do Dataframe
Dataframe_01.drop('Nova coluna',axis =1) #exclui a nova coluna do Dataframe 1

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [8]:
# Excluindo uma coluna definitavamente do Dataframe
Dataframe_01.drop('Nova coluna',axis=1,inplace=True)

In [9]:
Dataframe_01

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [10]:
# Localizando uma linha do Dataframe utilizando o comando Loc
Dataframe_01.loc['1ª Linha']

A    1
B   -3
C    0
Name: 1ª Linha, dtype: int64

In [11]:
Dataframe_01.loc['2ª Linha']

A     2
B    -2
C    10
Name: 2ª Linha, dtype: int64

In [12]:
Dataframe_01.loc['3ª Linha']

A     3
B    -1
C    20
Name: 3ª Linha, dtype: int64

In [13]:
# Localizando diversas  linhas e colunas
Dataframe_01.loc[['1ª Linha','2ª Linha'],['A','C']] # Nome da linha e nome da coluna

          A   C
1ª Linha  1   0
2ª Linha  2  10

In [14]:
# Localizando a linha e a coluna pelo indice
Dataframe_01.iloc[2:3,1:] # Linha, coluna

          B   C
3ª Linha -1  20

In [16]:
Dataframe_01.iloc[2:3,2:] # Linha, coluna

           C
3ª Linha  20

In [18]:
# Verificando as condiçoes no DataFrame
print(Dataframe_01)

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [19]:
#Criando filtro no Dataframe
Filtro = Dataframe_01['C'] >0 # Armazena em filtro a resposta da verificação
DataFrame_02= Dataframe_01[Filtro] # Cria um novo Dataframe

In [20]:
Dataframe_01 >0

             A      B      C
1ª Linha  True  False  False
2ª Linha  True  False   True
3ª Linha  True  False   True

In [21]:
Filtro

1ª Linha    False
2ª Linha     True
3ª Linha     True
Name: C, dtype: bool

In [22]:
# Cria um filtro utilizando a condição &
Dataframe_01[(Dataframe_01['A']>1) & (Dataframe_01['C']>0)]

          A  B   C
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [23]:
# Cria um filtro utilizando a condição or
Dataframe_01[(Dataframe_01['B']>5) | (Dataframe_01['C']>2)]

          A  B   C
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [24]:
Dataframe_01

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [25]:
#Resetando o index do Dataframe
Dataframe_01.reset_index()

      index  A  B   C
0  1ª Linha  1 -3   0
1  2ª Linha  2 -2  10
2  3ª Linha  3 -1  20

In [26]:
Dataframe_01

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [27]:
Dataframe_01.reset_index(inplace=True)

In [28]:
Dataframe_01

      index  A  B   C
0  1ª Linha  1 -3   0
1  2ª Linha  2 -2  10
2  3ª Linha  3 -1  20

In [29]:
Dataframe_01.drop('index',axis=1,inplace=True) # exclui coluna index

In [30]:
Dataframe_01

   A  B   C
0  1 -3   0
1  2 -2  10
2  3 -1  20

In [31]:
# Criando varios dicionarios
Dicionario_01 ={
    'A':[1,2,3],
    'B':[-32,-21,-15],
    'C':[60,10,20],
    'Chave':['AA','BB','CC']
}

# Dicionario 2
Dicionario_02= {
    'A':[6,7,8],
    'B':[-39,-28,-17],
    'C':[1000,10,60],
    'Chave':['AA','BB','CC']
}

# Dicionario 3

Dicionario_03 ={
    'A':[11,12,13],
    'B':[-39,-22,-11],
    'C':[30,10,20],
    'Chave':['AA','BB','CC']
}

# Criando as listas para serem os labels
Label_01 = ['1ª Linha','2ª Linha','3ª Linha']
Label_02 = ['4ª Linha','5ª Linha','6ª Linha']
Label_03 = ['7ª Linha','8ª Linha','9ª Linha']

# Criando os dataframes

Dataframe_01n =pd.DataFrame(Dicionario_01,index= Label_01)
Dataframe_02n =pd.DataFrame(Dicionario_02,index= Label_02)
Dataframe_03 =pd.DataFrame(Dicionario_03,index= Label_03)

In [32]:
Dataframe_01n # exibe o Dataframe 1

          A   B   C Chave
1ª Linha  1 -32  60    AA
2ª Linha  2 -21  10    BB
3ª Linha  3 -15  20    CC

In [33]:
Dataframe_02n

          A   B     C Chave
4ª Linha  6 -39  1000    AA
5ª Linha  7 -28    10    BB
6ª Linha  8 -17    60    CC

In [34]:
Dataframe_03

           A   B   C Chave
7ª Linha  11 -39  30    AA
8ª Linha  12 -22  10    BB
9ª Linha  13 -11  20    CC

In [35]:
# Empilhando os Dataframes 1,2 e 3
pd.concat([Dataframe_01n,Dataframe_02n,Dataframe_03])

           A   B     C Chave
1ª Linha   1 -32    60    AA
2ª Linha   2 -21    10    BB
3ª Linha   3 -15    20    CC
4ª Linha   6 -39  1000    AA
5ª Linha   7 -28    10    BB
6ª Linha   8 -17    60    CC
7ª Linha  11 -39    30    AA
8ª Linha  12 -22    10    BB
9ª Linha  13 -11    20    CC

In [36]:
# Mescla os dataframes utilizando o merge how inner verifica se a chave esta presente em
# ambos os lados do dataframe
pd.merge(Dataframe_01n,Dataframe_02n,how='inner',on='Chave')

   A_x  B_x  C_x Chave  A_y  B_y   C_y
0    1  -32   60    AA    6  -39  1000
1    2  -21   10    BB    7  -28    10
2    3  -15   20    CC    8  -17    60

In [37]:
pd.merge(Dataframe_01n,Dataframe_03,how='left',on='Chave')

   A_x  B_x  C_x Chave  A_y  B_y  C_y
0    1  -32   60    AA   11  -39   30
1    2  -21   10    BB   12  -22   10
2    3  -15   20    CC   13  -11   20

In [38]:
pd.merge(Dataframe_01n,Dataframe_03,how='right',on='Chave')

   A_x  B_x  C_x Chave  A_y  B_y  C_y
0    1  -32   60    AA   11  -39   30
1    2  -21   10    BB   12  -22   10
2    3  -15   20    CC   13  -11   20

In [39]:
pd.merge(Dataframe_01n,Dataframe_02n,how='outer',on='Chave')

   A_x  B_x  C_x Chave  A_y  B_y   C_y
0    1  -32   60    AA    6  -39  1000
1    2  -21   10    BB    7  -28    10
2    3  -15   20    CC    8  -17    60

In [40]:
# Juntando Dataframe utilizando o join
# Criando dicionarios
dic1 = {
    'A':[1,2,3],
    'B':[-32,-21,-15],
    'C':[60,10,20]
}

dic2 = {
    'D':[6,7,8],
    'E':[-39,-28,-17],
    'F':[1000,10,60]
}

# Criando o label
Label_01a = ['1ª Linha','2ª Linha', '3ª Linha']

# Estruturando o Dataframe

df01 = pd.DataFrame(dic1,index=Label_01a)
df02 = pd.DataFrame(dic2,index= Label_01a)
df01

          A   B   C
1ª Linha  1 -32  60
2ª Linha  2 -21  10
3ª Linha  3 -15  20

In [41]:
df02

          D   E     F
1ª Linha  6 -39  1000
2ª Linha  7 -28    10
3ª Linha  8 -17    60

In [42]:
df01.join(df02) # juntando os dataframes com join

          A   B   C  D   E     F
1ª Linha  1 -32  60  6 -39  1000
2ª Linha  2 -21  10  7 -28    10
3ª Linha  3 -15  20  8 -17    60